List listData = [
  {
    "id": "4525900000000000802",
    "level": 1,
    "name": "线下套餐",
    "pid": "4525900000000000800",
    "code": "1000",
    "pinyin": "XXTC"
  },
  {
    "id": "4525900000000000799",
    "level": 1,
    "name": "鱼单点",
    "pid": "4525900000000000798",
    "code": "1001",
    "pinyin": "YDD"
  },
  {
    "id": "4525900000000000801",
    "level": 1,
    "name": "线上套餐",
    "pid": "4525900000000000800",
    "code": "1002",
    "pinyin": "XSTC"
  },
  {
    "id": "4525900000000000807",
    "level": 1,
    "name": "QG全国美团外卖",
    "pid": "4525900000000000800",
    "code": "1004",
    "pinyin": "QGQGMTWM"
  },
  {
    "id": "4525900000000000808",
    "level": 1,
    "name": "QG全国饿了么外卖",
    "pid": "4525900000000000800",
    "code": "1005",
    "pinyin": "QGQGELMWM"
  },
  {
    "id": "4525900000000000806",
    "level": 1,
    "name": "上海美团外卖",
    "pid": "4525900000000000800",
    "code": "1008",
    "pinyin": "SHMTWM"
  },
  {
    "id": "4525900000000000803",
    "level": 1,
    "name": "上海饿了么外卖",
    "pid": "4525900000000000800",
    "code": "1009",
    "pinyin": "SHELMWM",
    "img":
        "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1602261597301&di=4afa64b5124ec5ce2bd36d8fdc9b72f7&imgtype=0&src=http%3A%2F%2Fi0.hdslb.com%2Fbfs%2Farticle%2F0221204fb954757f61af77d589f57cdc3e4e3f30.jpg",
  },
  {
    "id": "4525900000000000813",
    "level": 1,
    "name": "天津二区美团外卖",
    "pid": "4525900000000000800",
    "code": "1010",
    "pinyin": "TJEQMTWM"
  },
  {
    "id": "4525900000000000814",
    "level": 1,
    "name": "天津二区饿了么外卖",
    "pid": "4525900000000000800",
    "code": "1011",
    "pinyin": "TJEQELMWM",
    "img":
        "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1602261597301&di=4afa64b5124ec5ce2bd36d8fdc9b72f7&imgtype=0&src=http%3A%2F%2Fi0.hdslb.com%2Fbfs%2Farticle%2F0221204fb954757f61af77d589f57cdc3e4e3f30.jpg",
  },
  {
    "id": "4525900000000000809",
    "level": 1,
    "name": "武福南宁青太美团外卖",
    "pid": "4525900000000000800",
    "code": "1014",
    "pinyin": "WFNNQTMTWM"
  },
  {
    "id": "4525900000000000810",
    "level": 1,
    "name": "武福南宁青太饿了么外卖",
    "pid": "4525900000000000800",
    "code": "1015",
    "pinyin": "WFNNQTELMWM"
  },
  {
    "id": "4525900000000000763",
    "level": 1,
    "name": "堂食饮料",
    "pid": "4525900000000000754",
    "code": "2834",
    "pinyin": "TSYL"
  },
  {
    "id": "4525900000000000764",
    "level": 1,
    "name": "堂食鱼",
    "pid": "4525900000000000747",
    "code": "2835",
    "pinyin": "TSY"
  },
  {
    "id": "4525900000000000765",
    "level": 1,
    "name": "堂食味汁",
    "pid": "4525900000000000745",
    "code": "2836",
    "pinyin": "TSWZ"
  },
  {
    "id": "4525900000000000766",
    "level": 1,
    "name": "堂食凉菜",
    "pid": "4525900000000000752",
    "code": "2837",
    "pinyin": "TSLC"
  },
  {
    "id": "4525900000000000767",
    "level": 1,
    "name": "堂食啤酒",
    "pid": "4525900000000000748",
    "code": "2838",
    "pinyin": "TSPJ"
  },
  {
    "id": "4525900000000000768",
    "level": 1,
    "name": "堂食配菜",
    "pid": "4525900000000000750",
    "code": "2839",
    "pinyin": "TSPC"
  },
  {
    "id": "4525900000000000769",
    "level": 1,
    "name": "堂食主食",
    "pid": "4525900000000000746",
    "code": "2840",
    "pinyin": "TSZS"
  },
  {
    "id": "4525900000000000770",
    "level": 1,
    "name": "堂食调饮",
    "pid": "4525900000000000753",
    "code": "2842",
    "pinyin": "TSDY"
  },
  {
    "id": "4525900000000000771",
    "level": 1,
    "name": "堂食其他",
    "pid": "4525900000000000749",
    "code": "2844",
    "pinyin": "TSQT"
  },
  {
    "id": "4525900000000000773",
    "level": 1,
    "name": "堂食餐包",
    "pid": "4525900000000000749",
    "code": "2886",
    "pinyin": "TSCB"
  },
  {
    "id": "4525900000000000774",
    "level": 1,
    "name": "堂食打包盒",
    "pid": "4525900000000000749",
    "code": "2887",
    "pinyin": "TSDBH"
  },
  {
    "id": "4525900000000000775",
    "level": 1,
    "name": "堂食鱼-料包",
    "pid": "4525900000000000755",
    "code": "2901",
    "pinyin": "TSY-LB"
  },
  {
    "id": "4525900000000000779",
    "level": 1,
    "name": "外卖主食",
    "pid": "4525900000000000746",
    "code": "2911",
    "pinyin": "WMZS"
  },
  {
    "id": "4525900000000000780",
    "level": 1,
    "name": "外卖配菜",
    "pid": "4525900000000000750",
    "code": "2912",
    "pinyin": "WMPC"
  },
  {
    "id": "4525900000000000781",
    "level": 1,
    "name": "外卖凉菜",
    "pid": "4525900000000000752",
    "code": "2913",
    "pinyin": "WMLC"
  },
  {
    "id": "4525900000000000782",
    "level": 1,
    "name": "外卖调饮",
    "pid": "4525900000000000753",
    "code": "2914",
    "pinyin": "WMDY"
  },
  {
    "id": "4525900000000000783",
    "level": 1,
    "name": "外卖饮料",
    "pid": "4525900000000000754",
    "code": "2915",
    "pinyin": "WMYL"
  },
  {
    "id": "4525900000000000784",
    "level": 1,
    "name": "外卖打包盒",
    "pid": "4525900000000000749",
    "code": "2916",
    "pinyin": "WMDBH"
  },
  {
    "id": "4525900000000000785",
    "level": 1,
    "name": "外卖鱼",
    "pid": "4525900000000000747",
    "code": "2917",
    "pinyin": "WMY"
  },
  {
    "id": "4525900000000000786",
    "level": 1,
    "name": "外卖鱼-料包",
    "pid": "4525900000000000755",
    "code": "2918",
    "pinyin": "WMY-LB"
  },
  {
    "id": "4525900000000000788",
    "level": 1,
    "name": "外卖其他",
    "pid": "4525900000000000749",
    "code": "2920",
    "pinyin": "WMQT"
  },
  {
    "id": "4525900000000000790",
    "level": 1,
    "name": "堂食小吃",
    "pid": "4525900000000000760",
    "code": "2924",
    "pinyin": "TSXC"
  },
  {
    "id": "4525900000000000793",
    "level": 1,
    "name": "外卖小吃",
    "pid": "4525900000000000760",
    "code": "2929",
    "pinyin": "WMXC"
  }
];
